# GetFName

## Description
Function GetFName returns the current file name of the active document.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetFName : STRING;
```

```python

def vs.GetFName():
    return STRING
```

## Version
Availability: from MiniCAD
## Category
* Document Settings